<template>
    <div class="blog-container">
        <BlogHeader
            title="「2018」年终总结" subTitle=""
            date="2018-12-30" :tags="['言论与感想']">
        </BlogHeader>

        <BlogContent>
            <div slot="content">
                <h2>前言</h2>
                <p>
                    2018对我来说，发生了不少的变化。今年换了工作，开始接触广告业务。技术栈接入了更多移动端的内容。开始写公众号了，欢迎关注<code>“超哥前端小栈”</code>，一同探讨问题，交流技术。
                </p>

                <h2>技术</h2>
                <p>
                    今年，随着业务的发展，我做了更多偏移动端的技术储备，来年还会继续深入。还做了工程上的重构，以及发布流程的规范化，以提升多人协同开发的效率。具体的方面如下：
                </p>

                <p><strong>前端框架方面</strong></p>
                <ul>
                    <li>继续使用vue技术栈支持主要的业务需求</li>
                    <li>用react支持到了外围的基础工程</li>
                    <li>选取某个轻量级项目，实践开发了vue的electron桌面版</li>
                    <li>将PWA版本的react工程，纳入研究阶段</li>
                    <li>初步应用TypeScript，深感其静态编译和类型规范的强大作用。</li>
                </ul>

                <p><strong>工程搭建方面</strong></p>
                <ul>
                    <li>深入研究了webpack，并升级至V4版本，提升了团队的开发效率</li>
                    <li>根据业务的需要，从工程结构，编码规范，底层构建这几个方面，进行项目重构</li>
                    <li>与运维部门合作，重新规范发布过程</li>
                </ul>

                <h2>业务</h2>
                <p>
                    程序员需要关心业务么？我的回答，是的。
                </p>
                <p>
                    之前看到过一篇不错的文章
                    <a href="https://mp.weixin.qq.com/s/2JTxxH46FHrvcuG8KBTncg" target="_blank">《为什么码农要了解业务？》</a>
                    。如文中所说，IT研发与业务需求方，常常因为一个业务功能的实现，争辩得耳红面赤。研发觉得这个功能很low，没什么技术含量，业务方却认为这个功能却很有用，最后的结果通常是，高大上的功能做出来了，却很难用，或没法用。
                </p>
                <p>
                    鉴定一个功能是不是好功能，唯一的标准是看它能否支撑业务、改善业务、推动业务，也就是应用效果。如果程序员懂业务，在实现业务需求的同时，还能花功夫把功能，做细做深做好，那么我想，做出来的产品一定会很受业务以及用户的欢迎的。所以，程序员懂业务，真的很有必要。
                </p>
                <p>
                    我今年转入了游戏行业，从事广告业务方向的研发工作。有幸能与一群技术能力过硬，业务敏感度又高的小伙伴们，一起共事。与之前我经历过的互联网装修业务，金融业务相比，游戏的广告业务，有许多让我感兴趣，并且值得深入理解的地方。游戏的未来走向，也将是利用数据分析，更好地提升产品质量，延长产品的生命周期，以增长收益。
                </p>

                <h2>运动</h2>
                <p>
                    近几年随着年龄的增长，越发感到了运动的重要。
                </p>

                <p><strong>运动可以提升你的精气神</strong></p>
                <p>
                    过去，曾有位同事告诉我，有时太过专注地处理一个问题，时间一长，他就会感觉头脑发涨，只能停下歇一会儿，但思路却被迫打断了。我给了他一个建议，尝试每周跑步两次，每次3公里至5公里。一开始很难，但通过不懈地坚持，他逐渐感觉到了体能的上升，精神状态好了很多，头脑发胀的问题，也随之得到了缓解。我们总会有觉得精力不济的一天，坚持锻炼，可以延缓这一天到来的时间，或者可以逐渐改善这一问题。
                </p>

                <p><strong>运动可以让你变得自信</strong></p>
                <p>
                    过去，我因为长相一般，收入一般，也没有女朋友，而没有自信。有一天，我突然意识到，我需要改变，从控制体型开始。一开始很困难，身边的诱惑，外加自我的约束力不够，一度让我想要放弃。可是，坚持了一段时间之后，我发现衣服开始变得宽松了，周围人也发觉我变得有些不一样了。这给了我自信，我是可以控制自己的体型的。
                </p>

                <p><strong>运动可以让你找到你的另一半</strong></p>
                <p>
                    曾有个朋友很没自信地问我，你看像我这样的，该如何找女朋友？我的回答是，开始健身，并坚持下去。我曾经是个200斤的大胖子，因为健身带来的变化，让我找到了女朋友，后来我们结了婚，并有了一个可爱的宝宝，已经2岁半了。所以，努力坚持健身，以向你未来的另一半展现更好的自己。
                </p>

                <p><strong>运动可以促进团队的融合</strong></p>
                <p>
                    让我觉得欣喜的是，团队里越来越多的小伙伴，开始重视运动。我们会相互督促，保持每周至少三次去健身房的频率。我会教大家一些基础的动作，有些小伙伴还会暗自较劲，比一比谁能更快地进阶到下一阶段，过程十分地欢乐有趣。当然，这里也要感谢公司，为大家提供的健身福利。
                </p>

                <h2>阅读</h2>
                <p>
                    今年，除了持续关注各大前端公众号，阮大神的博客之外，几乎每天都会打开Segmentfault，看看是否又有好文或好书推荐了。此外，今年我看过的实体书有《高效前端：Web高效编程与优化实践》，《Vue.js实战》，《React状态管理与同构实战》，《深入浅出Webpack》等等。
                </p>
                <p>
                    其中，读到一本让我十分收益的书，书名为《软技能 代码之外的生存指南》。它不是一本纯粹的技术书，却告诉了我，软件开发人员的从业生涯中，不只有代码，还有诸如职业发展，自我营销、生产力、学习、理财、健身等等值得关注的方面，以及一位优秀的软件工程师该有的“活法”。
                </p>
                <p>
                    如果你感兴趣，欢迎关注我的公众号，可以获得这本书的免费资源哦~
                </p>

                <h2>知识的输出</h2>
                <p>
                    今年，我在公司内部，组织了一次面向40多人的技术分享会，是关于前端代码规范的。我花了一周的业余时间，用心准备PPT的素材和代码的示例，尽可能地让规范更贴近我们的编码习惯。分享会的原稿，在Segmentfault上也有，感兴趣的同学，可以前往
                    <a href="https://segmentfault.com/a/1190000015040583">《前端工程代码规范》</a> 查看，
                    该系列一共由4个部分组成，分别为命名规则与工程约定，以及Html、Css和JavaScript。
                </p>

                <p>
                    分享会结束之后，各项目组开始重新审视自己团队的代码规范，我也被拉入了一个前端讨论群，可以一起交流技术，探讨前端方面的问题。这让我萌生了一个想法，写面向公众的技术文章。我觉得如果能通过分享，认识更多热爱前端的小伙伴，一起切磋技术，交流心得，是件多么令人兴奋的事情啊~
                </p>

                <p>
                    近期，我的公众号 <code>“超哥前端小栈”</code> 正式上线了。主要分享一些前端方面的技术运用，以及心得体会。这里，要感谢我老婆的支持，主动承担起了小编的责任，当然，其中还包括了催更[哭脸地笑]。该公众号，目前会以每周发布2篇的速度更新。如果你觉得不错，希望能加以关注，并多多转发，非常感谢！
                </p>

                <h2>面向2019</h2>
                <p>
                    致敬将要过去的 2018 ，展望 2019。我做了如下计划：
                </p>

                <p><strong>工作方面</strong></p>
                <ul>
                    <li>react技术栈继续深入运用，并让PWA的研究落地</li>
                    <li>重拾微信小程序，学习理解AST(抽象语法书)的原理</li>
                    <li>进一步学习运用node、express、mysql的知识，写技术心得</li>
                    <li>继续深入理解广告业务，提出一个业务上的想法</li>
                </ul>

                <p><strong>其他方面</strong></p>
                <ul>
                    <li>写个人技术文章50篇，侧重点会往移动端偏移</li>
                    <li>读15本书，其中技术类至少4本</li>
                    <li>坚持每周健身4次，引体向上的单组数量突破至20个</li>
                    <li>养一只猫，培养娃的耐心与爱心</li>
                    <li>带娃旅行2次，一起练平板支撑，让她能坚持10秒</li>
                </ul>

                <p>希望新的一年，我们每个人，都能活成更好的自己~</p>
            </div>
        </BlogContent>
    </div>
</template>

<script>
    export default {
        created () {

        }
    };
</script>
