<template>
    <div class="blog-container">
        <BlogHeader
            title="「2018」年终总结" subTitle=""
            date="2018-12-30" :tags="['言论与感想']">
        </BlogHeader>

        <BlogContent>
            <div slot="content">
                <h2>前言</h2>
                <p>
                    站在2018的尾巴，回看走过的这一年，萌生了一些感想，想在此做个总结。
                </p>

                <h2>技术</h2>
                <p>
                    在前端框架方面，除了使用vue技术栈持续支持主要的业务以外，还用react支持到了外围的基础工程。同时，其中一个react工程的PWA版本纳入研究阶段。另外，选取了某个轻量级项目尝试了vue的electron桌面版。TypeScript的运用，还处于试水阶段，但在使用过程中，已经感受到了它强大的静态编译和类型规范，可以想象，在一个需要多人协作开发的项目中，将产生巨大的作用。
                </p>

                <p>
                    在前端工程的搭建方面，无论是vue，还是react，都实现了从 0 到 1 的突破。从写第一行package.json开始，到定制化webpack.config，完全契合当前的业务需要。年中的时候为了赶潮流，还升级了一把webpack4，虽然升级的过程中遇到了各种的坑，但在查找资料并最终填完坑后，看到运行与打包的速度，都有了显著的提高的时候，还是挺有成就感的。同时，这也提升了小伙伴的业务开发效率。
                </p>

                <h2>业务</h2>
                <p>
                    程序员需要关心业务么？我的回答，是的。
                </p>
                <p>
                    之前看到过一篇很棒的文章
                    <a href="https://mp.weixin.qq.com/s/2JTxxH46FHrvcuG8KBTncg" target="_blank">《为什么码农要了解业务？》</a>
                    ，推荐给大家。其中，详细地阐述了程序员关心业务的必要性，以及懂得了业务之后的带来好处。
                </p>
                <p>
                    今年因为工作的调动，让我有幸进入了游戏行业，从事广告业务方向的研发工作。也感恩有一群技术能力过硬，业务敏感度高，并值得信任的小伙伴，一起共事。让我从一个业务小白，从理解次留，roi，ltv等专业名词开始，逐步深耕广告业务，以数据驱动的方式，更精准地挖掘用户群体。
                </p>
                <p>
                    随着近期游戏版号的开放，游戏行业的春天已经悄然来临。相信在广告业务上，我们可以有更深的领悟，更优的体验。
                </p>

                <h2>运动</h2>
                <p>
                    近几年随着年龄的增长，越发感到了运动的重要。
                </p>
                <p>
                    过去，曾有位同事告诉我，有时太过专注地处理一个问题，时间一长，他就会感觉头脑发涨，只能停下歇一会儿，但思路却被迫打断了。我给了他一个建议，尝试每周跑步两次，每次3公里至5公里。一开始很难，但通过不懈地坚持，他逐渐感觉到了体能的上升，精神状态好了很多，头脑发胀的问题，也随之得到了缓解。我们总会有觉得精力不济的一天，坚持锻炼，可以延缓这一天到来的时间，或者可以逐渐改善这一问题。
                </p>

                <p>
                    让我觉得欣喜的是，团队里越来越多的小伙伴，开始重视运动。有的小伙伴，哪怕是“懒癌”犯了，也会在相互的督促下，跟着一起去跑步。我教会大家基础的动作之后，有些小伙伴还会暗自较劲，比一比谁能更快地进阶到下一阶段。所以说运动，真的很有意思。当然，这里也要感谢公司，为大家提供的健身福利。
                </p>

                <h2>阅读</h2>
                <p>
                    很遗憾，今年只读完了一本书，明年要加油了。不过却让我很受益，书名为《软技能 代码之外的生存指南》。
                </p>

                <p>
                    它不是一本纯粹的技术书，因为里面只是零星地提到了几个编程语言的名字而已。但却分别从职业、自我营销、学习、生产力、理财、健身、精神，这七个看似与软件开发毫无关系的方面，真正从“人”(而非技术也非管理)的角度，关注软件开发人员的自身发展。
                </p>

                <p>
                    有趣的是，这本书里，用了不小的篇幅讲述了作者与健身的故事，你能想象一位知名的软件开发人员，同时还是一名健美运动员么？如果你感兴趣，欢迎关注我的公众号 <code>“超哥前端小栈”</code>，可以获得这本书的免费资源哦~
                </p>

                <h2>写作</h2>
                <p>
                    直到今年，才萌生了写点公开的东西的想法。最初是因为一次关于前端规范的分享，本来我只打算做一次小范围的内部分享，给老板提了一下之后，他鼓励我说，可以做一次公司范围的分享。他来帮我搞定观众，并让我好好准备。
                </p>

                <p>
                    老实说，头一次准备面向40多人的分享会，不免有些紧张。所以，我花了一周的业余时间，准备PPT的素材和代码的示例，尽可能地让规范更贴近我们的编码习惯。
                </p>

                <p>
                    分享会的原稿，在Segmentfault上也有，感兴趣的同学，可以前往
                    <a href="https://segmentfault.com/a/1190000015040583">《前端工程代码规范》</a>，
                    该系列一共由4个部分组成，分别为命名规则与工程约定，以及Html、Css和JavaScript部分。组织这次分享会，我的感受是：同出一门的编码规范，真的可以提升开发效率。
                <p>
                    分享会开展的很顺利，会后还与其他项目组的同学，建立的前端讨论群，共同交流技术，探讨问题。这让我萌生了，写面向公众的技术文章的想法，我想通过写作，认识更多热爱前端的小伙伴，可以一起切磋技术，交流心得。
                </p>

                <p>
                    这里，要感谢我的老板，他引导我打开了一扇新的大门。近期，我的公众号 <code>“超哥前端小栈”</code> 开始运营，主要分享一些我遇到的问题，以及心得体会。这里，还要感谢老婆的支持，主动承担起了小编的责任，其中还包括了催更[哭脸地笑]。该公众号，目前会以每周2篇原创，1篇转载的速度更新。如果你觉得还不错，希望能加以关注，多多转发，非常感谢！
                </p>

                <h2>面向2019</h2>
                <p>
                    致敬将要过去的 2018 ，展望 2019。我做了如下计划：
                    <blockquote>
                        <ul>
                            <li>react技术栈继续深化，让PWA的研究落地</li>
                            <li>重拾微信小程序，归纳各大平台小程序的底层逻辑</li>
                            <li>进一步学习运用node、express、mysql的知识，写技术心得</li>
                            <li>继续深入理解广告业务，提出一个业务上的想法</li>
                            <li>个人技术文章50篇</li>
                            <li>一个季度读完一本书</li>
                            <li>引体向上数量，从目前的一组17个突破至20个</li>
                        </ul>
                    </blockquote>
                </p>

                <p>希望新的一年，我们每个人，都能活成更好的自己。</p>
            </div>
        </BlogContent>
    </div>
</template>

<script>
    export default {
        created () {

        }
    };
</script>
