<template>
    <div class="blog-container">
        <BlogHeader></BlogHeader>

        <BlogContent>
            <div slot="content">
                <h2>前言</h2>
                <p>
                    金三银四的求职季已经过半，但求职者的简历依然络绎不绝地涌过来。今年的大形势比较丧，不少大公司需要通过裁员降薪，或着停止招新，来 “过冬”。 所以，哪怕是有招聘需求的岗位，也会相应提高对应聘者的要求。
                </p>
                <p>
                    近期的高频面试，以及陆续收到的一些公众号上读者的反馈，让我产生了一些思考。今天，我们不谈面试中的技术问题，而是想聊一聊技术之外的 “软技能”，这些 “软技能” 或许能帮你更顺利地拿下 offer，希望对还在求职路上的同学有所帮助。
                </p>

                <h2>一些个人的综合素质</h2>

                <h4>1、基本的 “礼仪” 和 “仪容”。</h4>
                <p>
                    千万不要迟到。我个人是非常注重 <strong>“守时”</strong> 的，因为大家的时间都很宝贵，这也是面试开始的第一印象。我曾遇到过两位候选人，到点了没有到场，HR 联系对方也没有回音，在面试取消后的一刻钟左右，对方才打来电话说临时有事耽搁了，这时我也只能说一声 “抱歉没有缘分” 了。所以，如果在路上遇到堵车，或者突发事件时，可以提前联系 HR 说明情况，并表达歉意，这往往能给面试官留个好印象。
                </p>
                <p>
                    带好纸笔。
                </p>

                <h4>2、沟通能力。</h4>
                <p>

                </p>

                <h4>3、专业基础知识 和 过往项目经验</h4>
                <p>
                    简历上的一些建议，github、写全履历，篇幅长度。
                </p>
                <p>
                    别说自己不熟悉的领域。
                </p>

                <h4>4、不要作弊。</h4>
                <p>

                </p>

                <h4>5、最后的提问环节</h4>
                <p>
                    双向选择。加班与薪酬福利待遇。上门面试时，去卫生间看一下。
                </p>

                <h2>关于 996.ICU</h2>
                <p>
                    996.ICU。955.holidy。一个可以杜绝 996 的 eslint 插件 [误]。
                </p>

                <h2>一些干货</h2>
                <p>

                </p>

                <h2>岗位内推</h2>
                <p>
                    莉莉丝游戏招 <code>中高级前端工程师</code> 和 <code>广告系统开发工程师（Python 方向）</code>啦！！！
                </p>
                <p>
                    你玩过《<strong>小冰冰传奇</strong>（[刀塔传奇]）》么？你玩过《<strong>剑与家园</strong>》么？
                </p>
                <p>
                    你想和 <strong>薛兆丰老师</strong> 成为朋友么？有兴趣的同学，可以 <strong>关注下面的公众号 加我微信</strong> 详聊哈~
                </p>
            </div>
        </BlogContent>
    </div>
</template>

<script>
    export default {

    };
</script>
