<template>
    <div class="blog-container">
        <BlogHeader></BlogHeader>

        <BlogContent>
            <div slot="content">
                <h2>前言</h2>
                <p>
                    金三银四的求职季已经过半，但求职者的简历依然络绎不绝地涌过来。今年的大形势比较丧，不少大公司需要通过裁员降薪，或着停止招新，来 “过冬”。 所以，哪怕是有招聘需求的岗位，也会相应提高对应聘者的要求。在一些微信群中，也有同学感叹说面试机会变少，工作不好找。
                </p>
                <p>
                    近期的高频面试，以及陆续收到的一些公众号上读者的反馈，让我产生了一些思考。今天，我们不聊具体的技术问题，而是想探讨一些，在面试的过程中需要注意的 <strong>“非技术性的软技能”</strong>，以及一些个人的感悟。希望对还在求职路上的同学有所帮助。
                </p>

                <h2>一些软技能</h2>
                <p>
                    这里所说的 “软技能”，是指一些个人的综合素质。假设有一个与你的技术能力不相上下的人，共同摆在面试官的面前，这些 “软技能” 或许能让你脱颖而出。
                </p>

                <h4>1、礼仪 和 仪容</h4>
                <p>
                    千万不要迟到。面试官也是很忙的，除了日常的开发任务，还有各种的会议安排，如果因为你的迟到而打乱了面试官的日程安排，那第一印象就不好了，会影响整个面试的过程。但如果真的遇到突发事件时，可以提前联系说明情况，并表达歉意，这往往能给面试官留个好印象。
                </p>

                <p>
                    保持谦虚的态度。任何时候，把自己放在一个相对低的姿态，你是来面试，不是来教育面试官的，要抱着一种接受检阅和学习的态度，来对待面试。曾遇到过一位同学，在面试刚开始时，就拿出了纸和笔，说是为了在面试过程中，如果遇到答不上来的技术问题时，方便记录下来，好回去复习巩固。这一听，就让人觉得这小伙子不错，或许以后相处起来也会比较融洽的。
                </p>
                <p>
                    保持礼貌待人。多说“请”，“您”，“谢谢”，记得进门后关门，给你倒的水，在走的时候记得拿出去扔掉。面试时，坐有坐相，不要跟在家里一样太随便。说话口齿清楚，可以有条不紊地说得慢一些，但要注意把握细节的尺度。如果遇到和面试官有分歧的时候，不要争论，更不要试图说服面试官，点到即止。这是礼貌，与你的技术有多牛逼无关。
                </p>

                <p>
                    穿着得体，仪容整洁。穿着上，如无特别需要，不要着正装，休闲装就行。仪容上，女士可以化淡妆，也可以素颜；男士需要梳理一下头发，胡子刮干净。干净整洁无异味即可，以表示对本次面试的重视和对面试官的尊重。
                </p>

                <h4>2、沟通能力</h4>
                <p>
                    面试的过程，本质上就是一次沟通的过程。候选人在短时间内，要尽量地向面试官展现自己的长处，隐藏自己的短处，尽量让对方问题得到圆满答复并且留下较好印象。
                </p>

                <p>
                    在面试时，候选人一定要精神饱满，口齿清晰，自信对答。如果遇到答不上来的问题时，就老老实实的说 “这个我不清楚”，或者 “这个我不会”。千万不要不懂装懂，罗里吧嗦说了一堆，还说不到点子上的话，既浪费时间。而且我告诉大家，混是混不过去的，面试官问的问题，他自己肯定非常清楚答案，想糊弄过去或者胡乱回答，只会给自己 “埋坑”。
                </p>

                <p>
                    一道题答不上来，赶紧翻篇，不要想太多，那是会影响面试状态的。在最后谈薪酬的时候，也不要因为自己有些题没答好，而降低了期望薪资，只要不是漫天要价，就放心大胆地说出来，如果对方觉得略高，会再跟你商量的。但务必一开口就给人真诚，干练，专业的印象。
                </p>

                <h4>3、简历上的一些建议</h4>
                <p>
                    一份优秀的简历，往往能让你获得更多的面试机会。面试官在阅读一份简历的时候，往往会先找关键词，比如 React / Vue / Node 等的技术栈，然后是项目经验，再是 学历 / 工作背景 等，以及是否有 github 或技术博客等的加分项。
                </p>
                <p>
                    技术栈和项目经验很好理解，企业招人会先从成本考虑，熟练工自然是优先考虑。所以，一定要在第一屏就把你最擅长的技术栈，以及运用该技术的项目经验写清楚。
                </p>
                <p>
                    我发现很多候选人，不太重视自己过往的项目经验，这让我不能理解。我做过的每一个项目，虽然我在其中可能只负责编写某一个模块，或者功能，但我也会想办法搞清楚整个项目的业务流程，产品设计的意图，我们内部的功能是如何与外部实现集成的，以及整个系统的架构设计等等。我在面试候选人时，往往会先问最近一个项目的相关内容，有的候选人会说是他自己一个人完成了整个项目的搭建工作，但连其中有哪些模块，为何这样设计，最终如何落地，都答不出来，场面就很尴尬了。
                </p>

                <p>
                    所以，在面试前，应该好好把自己以前的项目经验都捋一捋，特别是最近的一个项目，从业务流程到产品设计到系统开发。然后，在写项目经验的时候，可以多加设计一番，想一想，当面试官按照你简历中写的 “剧本” 提问的时候，你会有多么从容呢~
                </p>

                <h4>4、不要作弊。</h4>
                <p>
                    这里说的不要作弊，分为两方面。一个体现在简历上，另一个是指做笔试题。
                </p>
                <p>
                    在简历上，不要把你不熟悉的领域写上去，更不要在其之前还写上熟悉或者精通的字样。如果你写了，那在面试之前一定要做足功课，不然岂不是搬起石头砸自己的脚么。另外，如果你真的没有 github，也不要拿别人的来冒充，被发现就太尴尬了。曾经遇到过一个小伙子的简历，在最上方就贴了 github 地址，点进去一看 repo 还不少，随机点开一个 repo 看源码，还挺有想法的。但是看到后面，却在其代码注释中看到一个博客地址，再进去一看，却明显感觉画风偏女性啊。一番追溯，最后发现，原来这小伙直接拿了别人的代码拷贝过来，在自己这儿新开了个 repo，却连那位小姐姐的博客地址都忘了删掉，太尴尬了。
                </p>

                <p>
                    另外一点，就是有些企业在面试程序员的时候，得先做一份笔试题。请记住，在做试卷的时候，千万不要用手机上网查询答案。本身作弊的行为就不好，再加上如果面试官在暗处进行观察，发现你作弊，那就太尴尬了。所以会就是会，不会就是不会，就算你把卷子都填满了，但当面试官再次摊开卷子逐个问你解题思路的时候，你回答不上来，岂不是更尴尬。
                </p>

                <h4>5、最后的提问环节</h4>
                <p>
                    面试的最后，都会有提问环节。我发现一个很奇怪的现象，很多同学在往往提不出什么问题。面试，是双选选择的一个过程。在自身的技术能力达到对方要求的前提下，当然还得考察这家公司是否适合自己的发展。
                </p>
                <p>
                    有一些思路，可以提供给你。比如，互联网行业都是需要加班的，那么就可以问与加班相对应的补偿机制，是否有调休，或者加班费？还可以问加班的频率等等。我在想，其实我们并不是不愿意加班，而是期望能通过加班给自己带来多少收益，换言之，加班的价值对于个人来说体现在哪里。
                </p>

                <p>
                    又比如，可以问问团队内部是否有技术分享，技术沙龙之类的活动。我们除了认真干活之外，还得考虑自身发展，分享或沙龙活动，能看出该团队的技术氛围如何，浓郁的技术氛围能帮助我们快速成长。我觉得，如果长期得不到技术能力上的增长，或许可以尝试着跳出舒适区，去寻找新的方向了。此外，更进一步地，可以问问公司对于员工的晋升有什么制度，职级又是如何划分的，这些都与个人的发展息息相关。
                </p>

                <p>问清楚了上面这些，你才能在与 HR 聊薪酬与福利待遇的时候，进退有度啊。</p>

                <h4>6、厕所与办公环境</h4>
                <p>
                    在上门面试时，建议抽空去卫生间看一下。主要是为了通过卫生间的情况，侧面了解企业管理者对治理企业的态度。如果一家公司的卫生间装修得不错，卫生条件也ok，甚至连厕纸的质量都挺好，那么在其他方面，对待员工应该也差不到哪里去。说来你可能不信，我见过的企业中，几乎都满足这一条。不好的企业卫生间一定比较破，设备坏了也不会及时修理，可能连厕纸都没有。而好的企业卫生间装修高档，设施干净，厕纸也比较厚与柔软。如果大家平时留意一下的话，就会发现，一些好的商场，高档的酒店，对于卫生间的装修和干净程度的要求，相对都会比较高。
                </p>
                <p>
                    顺道还可以一路观察办公环境，不求工作环境高大上，起码要整洁干净，如果办公环境明亮宽敞，干净整洁，大家要么安静地在做自己的事情，要么三两个聚在一起小声讨论问题的话，那么从工作环境上说还是个挺不错的企业的。
                </p>

                <h2>关于 996.ICU</h2>
                <p>
                    说起近期 github 上最火的 repo 非 <a href="https://996.icu/#/zh_CN" target="_blank">996.ICU</a> 莫属了，什么是 996.ICU ？工作 996，生病 ICU。随之又诞生了另一个与之对立的 repo，955.WLB，工作 955，work–life balance (工作与生活的平衡)。它们都呼声都很高。
                </p>
                <img src="~@/assets/blog/bg-20190403-01.jpg">

                <p>
                    此外，还看到过一些与之相关的插件，比如通过 eslint 控制每天 18:00 之后静止提交代码，周六周日 禁止代码变更。又比如，通过 precommit 钩子来禁止 git 提交等等。
                </p>

                <p>
                    其实我觉得，迎合 996 与否完全看自己。如果你觉得太辛苦，完全可以换一个相对轻松一些的，996 的工作强度并非有利于每个人的成长速度。而另一方面，正像某位大佬说的，现在的 996 工作制度，在未来的某一天回首时，会发现它是正确的选择，能抗下来的人，都会得到相应的成长。从某方面来说，我是认可这一点的，因为我早在两年前，就开始给自己实行 996 了。
                </p>

                <p>
                    太过舒适的环境，就像温水煮青蛙，当有一天生存环境崩塌时，想跳却力不从心了。技术人，应当保持一定的技术敏感度，学习是终生的事情。前端的发展速度实在太过迅猛，体系也很庞杂，如果你遇到了瓶颈，那就不要将自己只限制在浏览器端，Node 是一条通往服务端的路，RN 则是另一条通往客户端的路，还要好多的路，就不一一列举了。所以，要有信念，JavaScript 是可以一统天下的（凑不要脸地给自己打气 ^_^）。
                </p>

                <h2>一些干货</h2>
                <p>
                    值得庆幸的是，我警醒得还不晚。所以，在 2018 年底，我开了个人公众号 《超哥前端小栈》，并下定决心坚持每周更新一篇，会同步更新到
                    <a href="https://juejin.im/user/5a5d4522518825732b19d364" target="_blank">掘金</a>、
                    <a href="https://segmentfault.com/u/micherwa" target="_blank">segmentfault</a> 以及
                    <a href="https://github.com/micherwa" target="_blank">github</a>
                    上。并且定了个小目标，先坚持一年。主要聊聊技术、面试，聊聊前端人的成长，不定期还会有内推岗位，希望成为你的陪伴者。
                </p>

                <p>
                    每一篇公众号，都会耗费我大量的时间，有时甚至是连续几个晚上赶进度，因为我想把我理解的东西，用最通俗易懂的方式，朴实无华地表述出来。一般写完后，我会再校验至少 2 遍，将过长的内容进行提炼精简，检查表述是否到位，语句是否通顺，有无错别字等等。
                </p>

                <p>
                    每周发布完一篇之后，是我最焦虑的时候，因为下一篇该写什么，还没有着落。看过我公众号的同学，或许会觉得我的文章似乎并没有太多成体系的关联。因为我每次写的文章，都比较偏实战，灵感主要来源于一些小伙伴在实际工作中遇到的问题，看出了问题背后的本质是因为没有理解某个知识点。我觉得这些问题，也许也有同学会遇到，所以就整理成文了。
                </p>

                <p>
                    目前出了大概这样几个系列：面试、干货、源码、感悟。
                </p>

                <p>
                    面试系列：
                    <ul>
                        <li>
                            <a href="https://juejin.im/post/5c394da4518825253661bd4d" target="_blank">今日头条 面试题和思路解析</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c394fece51d45524c7cc712" target="_blank">如何实现一个圣杯布局？</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c36fd0f6fb9a049cd5465cd" target="_blank">伪类与伪元素的区别及实战</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c428ce0f265da612b13dca7" target="_blank">this的原理以及用法</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c612a60f265da2da15d9986" target="_blank">ES6 中箭头函数的用法</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c677041f265da2de25b7707" target="_blank">理解函数的柯里化</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c727abde51d457fc564cd77" target="_blank">JavaScript 中的事件机制（从原生到框架）</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c7b8b4af265da2dcb679d99" target="_blank">数组去重(10 种浓缩版)</a>
                        </li>
                    </ul>
                </p>

                <p>
                    干货系列：
                    <ul>
                        <li>
                            <a href="https://juejin.im/post/5c39523651882525a67c53d6" target="_blank">细说 async/await 相较于 Promise 的优势</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c3d28a9e51d45524c7cd3f7" target="_blank">Javascript中的异步编程</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c493086f265da6115111ce4" target="_blank">细说 call、apply 以及 bind 的区别和用法</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c846af3f265da2da835a875" target="_blank">细说 Array 的常用操作(ES5 和 ES6)</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c939345e51d452c4323a65b" target="_blank">一些有趣的 CSS 魔法和布局（上）</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c93964e6fb9a070c5511160" target="_blank">一些有趣的 CSS 魔法和布局（下）</a>
                        </li>
                    </ul>
                </p>

                <p>
                    源码解读：
                    <ul>
                        <li>
                            <a href="https://juejin.im/post/5c1d72356fb9a049e93cb5f4" target="_blank">还在恐惧读源码？看完这篇就不怕了</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c8c6c26f265da2db3059c93" target="_blank">我从 lodash 源码中学到的几个知识点</a>
                        </li>
                    </ul>
                </p>

                <p>
                    个人感悟：
                    <ul>
                        <li>
                            <a href="https://juejin.im/post/5c371cce518825261e1efc62" target="_blank">2018再见！</a>
                        </li>
                        <li>
                            <a href="https://juejin.im/post/5c428a5ff265da613f2fbe56" target="_blank">「写在寒冬」分享给前端er的求职和成长建议</a>
                        </li>
                        <li>
                            还有今天的这篇。
                        </li>
                    </ul>
                </p>

                <h2>岗位内推</h2>
                <p>
                    我所在的公司，福利待遇是具有竞争力的，有明确的晋升通道，每周还有两次内部分享。厕所的装修很高档，厕纸也很厚很软，办公环境很舒适。工作氛围浓郁，总能看见几人一圈围在一起讨论技术问题。
                </p>

                <p>
                    寒冬期，在这儿一点都不冷，因为。。。
                </p>

                <p>
                    莉莉丝游戏招 <code>中高级前端工程师</code> 啦！！！
                </p>
                <p>
                    你玩过《<strong>小冰冰传奇</strong>（[刀塔传奇]）》么？你玩过《<strong>剑与家园</strong>》么？
                </p>
                <p>
                    你想和 <strong>薛兆丰老师</strong> 成为同事么？有兴趣的同学，可以 <strong>关注下面的公众号 加我微信</strong> 详聊哈~
                </p>
            </div>
        </BlogContent>
    </div>
</template>

<script>
    export default {

    };
</script>
