<template>
    <div class="blog-container">
        <BlogHeader></BlogHeader>

        <BlogContent>
            <div slot="content">
                <h2>前言</h2>
                <p>
                    金三银四的求职季已经过半，但求职者的简历依然络绎不绝地涌过来。今年的大形势比较丧，不少大公司需要通过裁员降薪，或着停止招新，来 “过冬”。 所以，哪怕是有招聘需求的岗位，也会相应提高对应聘者的要求。在一些微信群中，也有同学感叹说面试机会变少，工作不好找。
                </p>
                <p>
                    近期的高频面试，以及陆续收到的一些公众号上读者的反馈，让我产生了一些思考。今天，我们不聊具体的技术问题，而是想探讨一些，在面试的过程中需要注意的 <strong>“非技术性的软技能”</strong>，以及一些个人的感悟。希望对还在求职路上的同学有所帮助。
                </p>

                <h2>一些软技能</h2>
                <p>
                    这里所说的 “软技能”，是指一些个人的综合素质。假设有一个与你的技术能力不相上下的人，共同摆在面试官的面前，这些 “软技能” 或许能让你脱颖而出。
                </p>

                <h4>1、礼仪 和 仪容</h4>
                <p>
                    千万不要迟到。面试官也是很忙的，除了日常的开发任务，还有各种的会议安排，如果因为你的迟到而打乱了面试官的日程安排，那第一印象就不好了，会影响整个面试的过程。但如果真的遇到突发事件时，可以提前联系说明情况，并表达歉意，这往往能给面试官留个好印象。
                </p>

                <p>
                    保持谦虚的态度。任何时候，把自己放在一个相对低的姿态，你是来面试，不是来教育面试官的，要抱着一种接受检阅和学习的态度，来对待面试。曾遇到过一位同学，在面试刚开始时，就拿出了纸和笔，说是为了在面试过程中，如果遇到答不上来的技术问题时，方便记录下来，好回去复习巩固。这一听，就让人觉得这小伙子不错，或许以后相处起来也会比较融洽的。
                </p>
                <p>
                    保持礼貌待人。多说“请”，“您”，“谢谢”，记得进门后关门，给你倒的水，在走的时候记得拿出去扔掉。面试时，坐有坐相，不要跟在家里一样太随便。说话口齿清楚，可以有条不紊地说得慢一些，但要注意把握细节的尺度。如果遇到和面试官有分歧的时候，不要争论，更不要试图说服面试官，点到即止。这是礼貌，与你的技术有多牛逼无关。
                </p>

                <p>
                    穿着得体，仪容整洁。穿着上，如无特别需要，不要着正装，休闲装就行。仪容上，女士可以化淡妆，也可以素颜；男士需要梳理一下头发，胡子刮干净。干净整洁无异味即可，以表示对本次面试的重视和对面试官的尊重。
                </p>

                <h4>2、沟通能力</h4>
                <p>
                    面试的过程，本质上就是一次沟通的过程。候选人在短时间内，要尽量地向面试官展现自己的长处，隐藏自己的短处，尽量让对方问题得到圆满答复并且留下较好印象。
                </p>

                <p>
                    在面试时，候选人一定要精神饱满，口齿清晰，自信对答。如果遇到答不上来的问题时，就老老实实的说 “这个我不清楚”，或者 “这个我不会”。千万不要不懂装懂，罗里吧嗦说了一堆，还说不到点子上的话，既浪费时间。而且我告诉大家，混是混不过去的，面试官问的问题，他自己肯定非常清楚答案，想糊弄过去或者胡乱回答，只会给自己 “埋坑”。
                </p>

                <p>
                    一道题答不上来，赶紧翻篇，不要想太多，那是会影响面试状态的。在最后谈薪酬的时候，也不要因为自己有些题没答好，而降低了期望薪资，只要不是漫天要价，就放心大胆地说出来，如果对方觉得略高，会再跟你商量的。但务必一开口就给人真诚，干练，专业的印象。
                </p>

                <h4>3、简历上的一些建议</h4>
                <p>
                    一份优秀的简历，往往能让你获得更多的面试机会。面试官在阅读一份简历的时候，往往会先找关键词，比如 React / Vue / Node 等的技术栈，然后是项目经验，再是学历，工作背景，以及是否有 github 或技术博客等的加分项。
                </p>
                <p>
                    技术栈和项目经验很好理解，企业招人会先从成本考虑，熟练工自然是优先考虑。所以，一定要在第一屏就把你最擅长的技术栈，以及运用该技术的项目经验写清楚。
                </p>
                <p>
                    我发现很多候选人，不太重视自己过往的项目经验，这让我不能理解。我做过的每一个项目，虽然我在其中可能只负责编写某一个模块，或者功能，但我也会想办法搞清楚整个项目的业务流程，产品设计的意图，我们内部的功能是如何与外部实现集成的，以及整个系统的架构设计等等。我在面试候选人时，往往会先问最近一个项目的相关内容，有的候选人会说是他自己一个人完成了整个项目的搭建工作，但连其中有哪些模块，为何这样设计，最终如何落地，都答不出来，场面就很尴尬了。
                </p>

                <p>
                    所以，在面试前，应该好好把自己以前的项目经验都捋一捋，特别是最近的一个项目，从业务流程到产品设计到系统开发。然后，在写项目经验的时候，可以多加设计一番，想一想，当面试官按照你简历中写的 “剧本” 提问的时候，你会有多么从容呢~
                </p>

                <h4>4、不要作弊。</h4>
                <p>
                    这里说的不要作弊，分为两方面。一个体现在简历上，另一个是指做笔试题。
                </p>
                <p>
                    在简历上，不要把你不熟悉的领域写上去，更不要在其之前还写上熟悉或者精通的字样。如果你写了，那在面试之前一定要做足功课，不然岂不是搬起石头砸自己的脚么。另外，如果你真的没有 github，也不要拿别人的来冒充。曾经遇到过一个小伙子的简历，在最上方就贴了 github 地址，点进去一看 repository 还不少，随机点开一个 repository 看源码，还挺有想法的。但是看到后面，却在其代码注释中看到一个博客地址，再进去一看，却明显感觉画风偏女性啊。一番追溯，最后发现，原来这小伙直接拿了别人的代码拷贝过来，在自己这儿新开了个 repository，却连那位小姐姐的博客地址都忘了删掉，太尴尬了。
                </p>

                <p>
                    另外一点，就是有些企业在面试程序员的时候，先得做一份笔试题。记住，在做试卷的时候，千万不要用手机上网查询答案。本身作弊的行为就让人不齿，再加上如果面试官在暗处进行观察，发现你作弊，那就太尴尬了。所以会就是会，不会就是不会，就算你把卷子都填满，但当面试官再次摊开卷子逐个问你解题思路的时候，你回答不上来，岂不是更尴尬。
                </p>

                <h4>5、最后的提问环节</h4>
                <p>
                    面试的最后，都会有提问环节。我发现一个很奇怪的现象，很多同学在往往提不出什么问题。面试，是双选选择的一个过程。在自身技能达到对方要求的前提下，当然还得考察这家公司是否适合自己的发展。
                </p>
                <p>
                    有一些思路，可以提供给你。比如，互联网行业都是需要加班的，那么就可以问与加班相对应的补偿机制，是否有调休，或者加班费？还可以问加班的频率等等。我在想，其实我们并不是不愿意加班，而是期望能通过加班给自己带来多少收益，换言之，加班的价值对于个人来说体现在哪里。
                </p>

                <p>
                    又比如，可以问问团队内部是否有技术分享，技术沙龙之类的活动。
                </p>
                <p>
                    双向选择。加班与薪酬福利待遇。上门面试时，去卫生间看一下。
                </p>

                <h2>关于 996.ICU</h2>
                <p>
                    996.ICU。955.holidy。一个可以杜绝 996 的 eslint 插件 [误]。
                </p>

                <h2>一些干货</h2>
                <p>

                </p>

                <h2>岗位内推</h2>
                <p>
                    莉莉丝游戏招 <code>中高级前端工程师</code> 和 <code>广告系统开发工程师（Python 方向）</code>啦！！！
                </p>
                <p>
                    你玩过《<strong>小冰冰传奇</strong>（[刀塔传奇]）》么？你玩过《<strong>剑与家园</strong>》么？
                </p>
                <p>
                    你想和 <strong>薛兆丰老师</strong> 成为同事么？有兴趣的同学，可以 <strong>关注下面的公众号 加我微信</strong> 详聊哈~
                </p>
            </div>
        </BlogContent>
    </div>
</template>

<script>
    export default {

    };
</script>
