<template>
    <div class="blog-container">
        <BlogHeader
            title="关于前端求职的困扰" subTitle=""
            date="2017-10-25" :tags="['言论与感想']">
        </BlogHeader>

        <BlogContent :useCatalog="true">
            <div slot="content">
                <blockquote>
                    <p>
                        源自 SF 上的
                        <a href="https://segmentfault.com/q/1010000011722610/a-1020000011725837" target="_blank">一篇回答</a>
                        ，记录下那时的一些感悟。
                    </p>
                </blockquote>

                <h2>一个小伙的问题描述</h2>
                <p>
                    起因：2017.1 打算走前端这条路，买了一本js高级教程看得很多视频，感觉还是和招聘的要求差很远。5月份决定系统的报了一下在线的培训班，利用晚上周末学习敲代码。十月份开始求职找工作。
                <p>
                    面试过程：有的看我简历上没有相关工作经验直接拒绝我的，有的有面试机会，闭包，原型，es6，html5新特性，都能回答很多，vue路由，vuex，vue框架很多问题也能回答出来，唯一的不足感觉就是没有工作经验，之前是做运维的，主要负责sqlserver的业务系统的维护，好多公司直接是后端面试，感觉能问前端的问题很少，之前面试遇到不会得问题，自己也回来总结记录了。有些自己面试感觉回答的挺满意的，但是依然没有录取。
                </p>
                <p>
                    个人情况：专业信息管理，2016年毕业，学校华东交通大学。希望各位大哥大姐能给我点建议。有某个别跟我情况差不多的，简历造假找到工作了，我真的不想造假，但是现在又找不到合适的，之前有几个说要一天作息时间是12小时，有一个是6k待遇的，感觉她们很瞧不起前端，觉得谁都能做，目前找工作快一个月了，很迷茫，求哪位大哥指点一下？
                </p>

                <h2>我的回答</h2>
                <p>有以下几点建议：</p>

                <h4>1.心态</h4>
                <p>
                    互联网公司几乎都是要加班的。如果一个肯给你满意薪资的公司说，每天工作10小时。另一个每天8小时，但薪资差一些，你怎么选？
                </p>
                <p>
                    一般面试的最后，总会问，你有什么要问主考官的，这块没看你有提及，这其实还挺重要的。<br>
                    同样是来自培训班的新人，求知欲够不够？沟通能力强不强？自身定位清晰与否？都是影响最终结果的因素。
                </p>

                <h4>2.培训班</h4>
                <p>
                    培训班在我的印象里并不怎么好。主要是这么短的时间内，做出来作品看上去像有工作一年多的人做出来的，但是面了两三个人之后，就会发现：做出来的作品，竟然都是一个模板。
                </p>
                <p>
                    在面试的时候，除了拿出培训班的作品之外，可以再拿出点自己鼓捣的东西，或者如果有会后端的同学，一起合作个简单的小项目，一定会加分的。因为在工作中，协同合作和沟通交流，太重要了。
                </p>

                <h4>3.vue</h4>
                <p>
                    会vue，并不是敲门砖。<br>
                    但是，如果是同一个demo，你能用angular(1/2/4)，或者react实现一遍。以此来说说，这3大主流框架在你使用过程中的感受，它们之间的区别是什么，会是个不错的加分项。起码给人非常好学，喜欢钻研的感觉。
                </p>

                <h4>4.最后</h4>
                <p>
                    前端的体系庞杂，从培训班出来，只能说明你准备走这条路而已。一起还得从头开始，把心静下来，好好沉淀。综合考虑薪资和作息，只要不是太委屈，就先做起来，你的前端经验就能早一天开始累积。
                </p>
                <p>
                    没什么好迷茫的，路就在那里，只是看你想怎么走，走的时候心情如何罢了。
                </p>
            </div>
        </BlogContent>
    </div>
</template>

<script>
    export default {
        created () {

        }
    };
</script>
