export default [
    {
        title: '「阮一峰网络日志」API之下',
        subTitle: '',
        routeName: 'below-of-api',
        descript: '虽然标题里面有 API，但是本文谈的不是编程，而是更重要的事情。很多公司的组织架构，都有一个中层。高层领导和基层员工之间，存在大量的中层干部。公司越大，中层干部越多。2015年，硅谷创业家莱因哈特（Peter Reinhardt）观察到一个现象：硅谷科技公司正在变得越来越大，但是公司的中层几乎没有变大。原因就在于，大公司正在用 API 替代掉中层干部。',
        date: '2018-08-13',
        tags: ['言论与感想']
    },
    {
        title: '前端工程代码规范（一）',
        subTitle: '命名规则与工程约定',
        routeName: 'front-end-code-criterion-1',
        descript: '随着前端团队人员的逐步扩大，需要有一份规范来约束代码的书写。无论人数多少，代码都应该同出一门。主要参考了腾讯alloyteam团队，里面有许多的认同点。在此基础上做了些许改进，为了更适合自己团队，那些已经达成共识的代码习惯。仅供参考。',
        date: '2018-05-26',
        tags: ['前端代码规范']
    }
];
